Repository: wolfwdavid/cross_platform_c11
Catalog: Resources/Localizable.xcstrings
Source language: en
Languages: ja, ko, ru, uk, zh_hans, zh_hant

# sidebar.indicator.solidFill
source: Solid Fill
ja: ソリッドフィル
ko: 단색 채우기
ru: Сплошная заливка
uk: Суцільна заливка
zh_hans: 纯色填充
zh_hant: 實心填充

# sidebar.metadata.showLess
source: Show Less
ja: 表示を減らす
ko: 간략히 보기
ru: Показать меньше
uk: Показати менше
zh_hans: 收起
zh_hant: 顯示較少

# sidebar.metadata.showLessDetails
source: Show Less Details
ja: 詳細を折りたたむ
ko: 세부 정보 접기
ru: Показать меньше подробностей
uk: Показати менше деталей
zh_hans: 收起详细信息
zh_hant: 顯示較少詳細資訊

# sidebar.metadata.showMore
source: Show More
ja: さらに表示
ko: 더 보기
ru: Показать больше
uk: Показати більше
zh_hans: 展开
zh_hant: 顯示更多

# sidebar.metadata.showMoreDetails
source: Show More Details
ja: 詳細を展開
ko: 세부 정보 펼치기
ru: Показать больше подробностей
uk: Показати більше деталей
zh_hans: 展开详细信息
zh_hant: 顯示更多詳細資訊

# sidebar.pullRequest.openTooltip
source: Open %1$@ #%2$lld
ja: %1$@ #%2$lldを開く
ko: %1$@ #%2$lld 열기
ru: Открыть %1$@ #%2$lld
uk: Відкрити %1$@ #%2$lld
zh_hans: 打开 %1$@ #%2$lld
zh_hant: 開啟 %1$@ #%2$lld

# sidebar.pullRequest.statusClosed
source: closed
ja: クローズ
ko: 닫힘
ru: закрыт
uk: закрито
zh_hans: 已关闭
zh_hant: 已關閉

# sidebar.pullRequest.statusMerged
source: merged
ja: マージ済み
ko: 병합됨
ru: объединен
uk: об'єднано
zh_hans: 已合并
zh_hant: 已合併

# sidebar.pullRequest.statusOpen
source: open
ja: オープン
ko: 열림
ru: открыт
uk: відкрито
zh_hans: 打开
zh_hant: 開啟

# sidebar.remote.help.connected
source: SSH connected to %@
ja: SSH は %@ に接続済み
ko: SSH가 %@에 연결됨
ru: SSH подключён к %@
uk: SSH підключено до %@
zh_hans: SSH 已连接到 %@
zh_hant: SSH 已連線至 %@

# sidebar.remote.help.connecting
source: SSH connecting to %@
ja: SSH は %@ に接続中
ko: SSH가 %@에 연결 중
ru: SSH подключается к %@
uk: SSH підключається до %@
zh_hans: SSH 正在连接 %@
zh_hant: SSH 連線至 %@ 中

# sidebar.remote.help.disconnected
source: SSH disconnected from %@
ja: SSH は %@ から切断済み
ko: SSH가 %@에서 연결 끊김
ru: SSH отключён от %@
uk: SSH відключено від %@
zh_hans: SSH 已从 %@ 断开
zh_hant: SSH 已從 %@ 中斷連線

# sidebar.remote.help.error
source: SSH error for %@
ja: %@ の SSH エラー
ko: %@의 SSH 오류
ru: Ошибка SSH для %@
uk: Помилка SSH для %@
zh_hans: %@ 的 SSH 错误
zh_hant: %@ 的 SSH 錯誤

# sidebar.remote.help.errorWithDetail
source: SSH error for %@: %@
ja: %@ の SSH エラー: %@
ko: %@의 SSH 오류: %@
ru: Ошибка SSH для %@: %@
uk: Помилка SSH для %@: %@
zh_hans: %1$@ 的 SSH 错误：%2$@
zh_hant: %1$@ 的 SSH 錯誤：%2$@

# sidebar.remote.help.targetFallback
source: remote host
ja: リモートホスト
ko: 원격 호스트
ru: удалённый хост
uk: віддалений хост
zh_hans: 远程主机
zh_hant: 遠端主機

# sidebar.remote.subtitleFallback
source: SSH workspace
ja: SSH ワークスペース
ko: SSH 작업 공간
ru: Рабочее пространство SSH
uk: Робочий простір SSH
zh_hans: SSH 工作区
zh_hant: SSH 工作區

# sidebar.workspace.accessibilityHint
source: Activate to focus this workspace. Drag to reorder, or use Move Up and Move Down.
ja: アクティブにしてこのワークスペースにフォーカスします。ドラッグで並べ替え、または「上に移動」「下に移動」を使用します。
ko: 이 작업 공간에 포커스하려면 활성화하세요. 드래그하여 순서를 변경하거나 위로 이동 및 아래로 이동을 사용하세요.
ru: Активируйте для перехода к этому рабочему пространству. Перетащите для изменения порядка или используйте «Переместить вверх» и «Переместить вниз».
uk: Активуйте, щоб сфокусувати цей робочий простір. Перетягніть, щоб змінити порядок, або скористайтеся «Перемістити вгору» та «Перемістити вниз».
zh_hans: 激活以聚焦此工作区。拖拽以重新排序，或使用上移和下移。
zh_hant: 啟用以聚焦此工作區。拖曳以重新排序，或使用「上移」和「下移」。

# sidebar.workspace.moveDownAction
source: Move Down
ja: 下に移動
ko: 아래로 이동
ru: Переместить вниз
uk: Перемістити вниз
zh_hans: 下移
zh_hant: 下移

# sidebar.workspace.moveUpAction
source: Move Up
ja: 上に移動
ko: 위로 이동
ru: Переместить вверх
uk: Перемістити вгору
zh_hans: 上移
zh_hant: 上移

# socketControl.allowAll.description
source: Allow any local process and user to connect with no auth. Unsafe.
ja: 認証なしで任意のローカルプロセスおよびユーザーの接続を許可します。安全ではありません。
ko: 인증 없이 모든 로컬 프로세스 및 사용자의 연결을 허용합니다. 안전하지 않습니다.
ru: Разрешить подключение любому локальному процессу и пользователю без авторизации. Небезопасно.
uk: Дозволяє будь-якому локальному процесу та користувачу підключатися без авторизації. Небезпечно.
zh_hans: 允许任何本地进程和用户无需认证即可连接。不安全。
zh_hant: 允許任何本機程序和使用者連線，無需驗證。不安全。

# socketControl.allowAll.name
source: Full open access
ja: 完全オープンアクセス
ko: 전체 개방 접근
ru: Полный открытый доступ
uk: Повний відкритий доступ
zh_hans: 完全开放访问
zh_hant: 完全開放存取

# socketControl.automation.description
source: Allow external local automation clients from this macOS user (no ancestry check).
ja: この macOS ユーザーからの外部ローカル自動化クライアントを許可します（プロセス系譜チェックなし）。
ko: 이 macOS 사용자의 외부 로컬 자동화 클라이언트를 허용합니다 (출처 확인 없음).
ru: Разрешить внешним клиентам автоматизации от текущего пользователя macOS (без проверки происхождения).
uk: Дозволяє зовнішнім локальним клієнтам автоматизації від цього користувача macOS (без перевірки походження).
zh_hans: 允许当前 macOS 用户的外部本地自动化客户端连接（不检查进程来源）。
zh_hant: 允許此 macOS 使用者的外部本機自動化用戶端（不檢查來源）。

# socketControl.automation.name
source: Automation mode
ja: 自動化モード
ko: 자동화 모드
ru: Режим автоматизации
uk: Режим автоматизації
zh_hans: 自动化模式
zh_hant: 自動化模式

# socketControl.cmuxOnly.description
source: Only processes started inside c11 terminals can send commands.
ja: c11 ターミナル内で起動したプロセスのみがコマンドを送信できます。
ko: c11 터미널 내에서 시작된 프로세스만 명령을 보낼 수 있습니다.
ru: Только процессы, запущенные в терминалах c11, могут отправлять команды.
uk: Тільки процеси, запущені в терміналах c11, можуть надсилати команди.
zh_hans: 仅允许在 c11 终端内启动的进程发送命令。
zh_hant: 僅在 c11 終端機內啟動的程序可以傳送指令。

# socketControl.cmuxOnly.name
source: c11 processes only
ja: c11 プロセスのみ
ko: c11 프로세스만
ru: Только процессы c11
uk: Тільки процеси c11
zh_hans: 仅限 c11 进程
zh_hant: 僅限 c11 程序

# socketControl.error.passwordFilePath
source: Unable to resolve socket password file path.
ja: ソケットパスワードファイルのパスを解決できません。
ko: 소켓 비밀번호 파일 경로를 확인할 수 없습니다.
ru: Не удалось определить путь к файлу пароля сокета.
uk: Не вдалося визначити шлях до файлу пароля сокета.
zh_hans: 无法解析套接字密码文件路径。
zh_hant: 無法解析 Socket 密碼檔案路徑。

# socketControl.off.description
source: Disable the local control socket.
ja: ローカルコントロールソケットを無効にします。
ko: 로컬 제어 소켓을 비활성화합니다.
ru: Отключить локальный управляющий сокет.
uk: Вимкнути локальний сокет керування.
zh_hans: 禁用本地控制套接字。
zh_hant: 停用本機控制 Socket。

# socketControl.off.name
source: Off
ja: オフ
ko: 끔
ru: Выключено
uk: Вимкнено
zh_hans: 关闭
zh_hant: 關閉

# socketControl.password.description
source: Require socket authentication with a password stored in a local file.
ja: ローカルファイルに保存されたパスワードでソケット認証を要求します。
ko: 로컬 파일에 저장된 비밀번호로 소켓 인증을 요구합니다.
ru: Требовать аутентификацию сокета с паролем, хранящимся в локальном файле.
uk: Вимагати автентифікацію сокета з паролем, що зберігається в локальному файлі.
zh_hans: 使用存储在本地文件中的密码进行套接字认证。
zh_hant: 使用儲存在本機檔案中的密碼進行 Socket 驗證。

# socketControl.password.name
source: Password mode
ja: パスワードモード
ko: 비밀번호 모드
ru: Режим пароля
uk: Режим пароля
zh_hans: 密码模式
zh_hant: 密碼模式

# statusBar.jumpToUnread.accessibility
source: Jump to next unread notification
ja: 次の未読通知へジャンプ
ko: 다음 읽지 않은 알림으로 이동
ru: Перейти к следующему непрочитанному уведомлению
uk: Перейти до наступного непрочитаного сповіщення
zh_hans: 跳到下一条未读通知
zh_hant: 跳至下一則未讀通知

# statusBar.nextNotification.title
source: Next Notification
ja: 次の通知
ko: 다음 알림
ru: Следующее уведомление
uk: Наступне сповіщення
zh_hans: 下一条通知
zh_hant: 下一則通知

# statusMenu.clearAll
source: Clear All
ja: すべてクリア
ko: 모두 지우기
ru: Очистить все
uk: Очистити все
zh_hans: 全部清除
zh_hant: 清除全部

# statusMenu.jumpToLatestUnread
source: Jump to Latest Unread
ja: 最新の未読にジャンプ
ko: 최신 읽지 않은 항목으로 이동
ru: Перейти к последнему непрочитанному
uk: Перейти до останнього непрочитаного
zh_hans: 跳转到最新未读
zh_hant: 跳至最新未讀

# statusMenu.markAllRead
source: Mark All Read
ja: すべて既読にする
ko: 모두 읽음으로 표시
ru: Отметить все как прочитанные
uk: Позначити все як прочитане
zh_hans: 全部标记为已读
zh_hant: 全部標為已讀

# statusMenu.noUnread
source: No unread notifications
ja: 未読の通知はありません
ko: 읽지 않은 알림 없음
ru: Нет непрочитанных уведомлений
uk: Немає непрочитаних сповіщень
zh_hans: 没有未读通知
zh_hant: 沒有未讀通知

# statusMenu.showNotifications
source: Show Notifications
ja: 通知を表示
ko: 알림 표시
ru: Показать уведомления
uk: Показати сповіщення
zh_hans: 显示通知
zh_hant: 顯示通知

# statusMenu.tooltip.unread.one
source: 1 unread notification
ja: 未読通知 1件
ko: 읽지 않은 알림 1개
ru: 1 непрочитанное уведомление
uk: 1 непрочитане сповіщення
zh_hans: 1 条未读通知
zh_hant: 1 則未讀通知

# statusMenu.tooltip.unread.other
source: %lld unread notifications
ja: 未読通知 %lld件
ko: 읽지 않은 알림 %lld개
ru: Непрочитанных уведомлений: %lld
uk: Непрочитаних сповіщень: %lld
zh_hans: %lld 条未读通知
zh_hant: %lld 則未讀通知

# statusMenu.unreadCount.one
source: 1 unread notification
ja: 未読通知 1件
ko: 읽지 않은 알림 1개
ru: 1 непрочитанное уведомление
uk: 1 непрочитане сповіщення
zh_hans: 1 条未读通知
zh_hant: 1 則未讀通知

# statusMenu.unreadCount.other
source: %lld unread notifications
ja: 未読通知 %lld件
ko: 읽지 않은 알림 %lld개
ru: Непрочитанных уведомлений: %lld
uk: Непрочитаних сповіщень: %lld
zh_hans: %lld 条未读通知
zh_hant: %lld 則未讀通知

# surfaceManifest.copiedButton
source: Copied
ja: コピー済み
ko: 복사됨
ru: Скопировано
uk: Скопійовано
zh_hans: 已复制
zh_hant: 已複製

# surfaceManifest.copyButton
source: Copy JSON
ja: JSON をコピー
ko: JSON 복사
ru: Скопировать JSON
uk: Скопіювати JSON
zh_hans: 复制 JSON
zh_hant: 複製 JSON

# surfaceManifest.empty
source: No metadata set on this surface.
ja: このサーフェスにはメタデータが設定されていません。
ko: 이 서피스에는 설정된 메타데이터가 없습니다.
ru: На этой поверхности метаданные не заданы.
uk: Для цієї поверхні метаданих не задано.
zh_hans: 此界面未设置元数据。
zh_hant: 此介面未設定中繼資料。

# surfaceManifest.header.capturedAt
source: Captured
ja: 取得時刻
ko: 캡처 시각
ru: Снято
uk: Знято
zh_hans: 捕获于
zh_hant: 擷取於

# surfaceManifest.header.kind
source: Kind
ja: 種類
ko: 종류
ru: Тип
uk: Тип
zh_hans: 类型
zh_hant: 類型

# surfaceManifest.header.surface
source: Surface
ja: サーフェス
ko: 서피스
ru: Поверхность
uk: Поверхня
zh_hans: 界面
zh_hant: 介面

# surfaceManifest.header.workspace
source: Workspace
ja: ワークスペース
ko: 작업 공간
ru: Рабочее пространство
uk: Робочий простір
zh_hans: 工作区
zh_hant: 工作區

# surfaceManifest.kind.browser
source: Browser
ja: ブラウザ
ko: 브라우저
ru: Браузер
uk: Браузер
zh_hans: 浏览器
zh_hant: 瀏覽器

# surfaceManifest.kind.terminal
source: Terminal
ja: ターミナル
ko: 터미널
ru: Терминал
uk: Термінал
zh_hans: 终端
zh_hant: 終端機

# surfaceManifest.menuItem
source: Show surface manifest…
ja: サーフェスマニフェストを表示…
ko: 서피스 매니페스트 표시…
ru: Показать манифест поверхности…
uk: Показати маніфест поверхні…
zh_hans: 显示界面清单…
zh_hant: 顯示介面清單…

# surfaceManifest.refreshButton
source: Refresh
ja: 更新
ko: 새로고침
ru: Обновить
uk: Оновити
zh_hans: 刷新
zh_hant: 重整

# surfaceManifest.sources.column.key
source: Key
ja: キー
ko: 키
ru: Ключ
uk: Ключ
zh_hans: 键
zh_hant: 鍵

# surfaceManifest.sources.column.source
source: Source
ja: ソース
ko: 소스
ru: Источник
uk: Джерело
zh_hans: 来源
zh_hant: 來源

# surfaceManifest.sources.column.timestamp
source: Set at
ja: 設定時刻
ko: 설정 시각
ru: Когда задано
uk: Коли задано
zh_hans: 设置时间
zh_hant: 設定時間

# surfaceManifest.sources.disclosure
source: Show sources
ja: ソースを表示
ko: 소스 표시
ru: Показать источники
uk: Показати джерела
zh_hans: 显示来源
zh_hant: 顯示來源

# surfaceManifest.sources.empty
source: No source records.
ja: ソース記録はありません。
ko: 소스 기록이 없습니다.
ru: Записей об источниках нет.
uk: Немає записів про джерела.
zh_hans: 没有来源记录。
zh_hant: 沒有來源記錄。

# surfaceManifest.windowTitle
source: Surface manifest
ja: サーフェスマニフェスト
ko: 서피스 매니페스트
ru: Манифест поверхности
uk: Маніфест поверхні
zh_hans: 界面清单
zh_hant: 介面清單

# tab.bar.state.full
source: Full
ja: 全表示
ko: 전체
ru: Полный
uk: Повний
zh_hans: 完整
zh_hant: 完整

# tab.bar.state.hidden
source: Hidden
ja: 非表示
ko: 숨겨짐
ru: Скрытый
uk: Прихований
zh_hans: 隐藏
zh_hant: 隱藏

# tab.bar.state.shrunk
source: Shrunk
ja: 折りたたみ
ko: 축소됨
ru: Свёрнутый
uk: Стиснутий
zh_hans: 缩小
zh_hant: 縮小

# tab.untitled
source: Untitled Tab
ja: 名称未設定タブ
ko: 제목 없는 탭
ru: Безымянная вкладка
uk: Безіменна вкладка
zh_hans: 未命名标签页
zh_hant: 未命名標籤頁

# tccPrimer.body.fullDisk
source: Grant Full Disk Access once in System Settings → Privacy & Security and you won't see individual dialogs at all. This is what iTerm2, Warp, and Ghostty recommend for engineers running many agents. You can revoke it any time.
ja: システム設定 → プライバシーとセキュリティで Full Disk Access を一度許可するだけで、個別のダイアログは一切表示されなくなります。これは多くのエージェントを動かすエンジニアに iTerm2、Warp、Ghostty が推奨していることです。いつでも取り消せます。
ko: 시스템 설정 → 개인 정보 보호 및 보안에서 Full Disk Access를 한 번 허용하면 개별 대화상자가 전혀 표시되지 않아요. 이것이 많은 에이전트를 실행하는 엔지니어에게 iTerm2, Warp, Ghostty가 권장하는 방식이에요. 언제든지 취소할 수 있어요.
ru: Выдайте Full Disk Access один раз в Системных настройках → Конфиденциальность и безопасность, и вы больше не увидите отдельных диалогов. Именно это рекомендуют инженерам, запускающим много агентов, iTerm2, Warp и Ghostty. Вы можете отозвать его в любой момент.
uk: Надайте Full Disk Access один раз у Системних налаштуваннях → Конфіденційність і безпека, і жодних індивідуальних діалогів більше не з'явиться. Саме це рекомендують інженерам, які запускають багато агентів, iTerm2, Warp і Ghostty. Ви можете відкликати це будь-коли.
zh_hans: 在系统设置 → 隐私与安全性中一次性授予 Full Disk Access，就再也不会看到单个权限对话框了。这是 iTerm2、Warp 和 Ghostty 为运行大量代理的工程师所推荐的做法。您可以随时撤销。
zh_hant: 在系統設定 → 隱私與安全性中一次授予 Full Disk Access，就再也不會看到個別的權限對話框了。這是 iTerm2、Warp 和 Ghostty 為執行大量代理的工程師所推薦的做法。您可以隨時撤銷。

# tccPrimer.body.granted
source: Thanks — Full Disk Access granted. Continuing…
ja: ありがとうございます。Full Disk Access が許可されました。続けます…
ko: 감사해요. Full Disk Access가 허용됐어요. 계속할게요…
ru: Спасибо — Full Disk Access предоставлен. Продолжаем…
uk: Дякуємо — Full Disk Access надано. Продовжуємо…
zh_hans: 感谢，Full Disk Access 已授予。继续中……
zh_hant: 感謝，Full Disk Access 已授予。繼續中……

# tccPrimer.body.sayNo.lead
source: Feel free to say no to any of them.
ja: どれも遠慮なく「許可しない」で大丈夫です。
ko: 어느 것이든 편하게 거절해도 괜찮아요.
ru: Смело отказывайте любому из них.
uk: Сміливо відмовляйте будь-якому з них.
zh_hans: 任何一项都可以放心拒绝。
zh_hant: 任何一項都可以放心拒絕。

# tccPrimer.body.sayNo.tail
source: c11 itself doesn't scan your files, and nothing is forwarded to Stage 11. If you deny a folder, the command that tripped it will just fail, and you can grant it later in System Settings.
ja: c11 自体があなたのファイルをスキャンすることはなく、Stage 11 に何かが送られることもありません。フォルダを拒否しても、きっかけになったコマンドが失敗するだけで、あとから System Settings で許可できます。
ko: c11 자체는 파일을 스캔하지 않고, Stage 11으로 아무것도 전송되지 않아요. 폴더를 거부하면 해당 권한을 요청한 명령이 그냥 실패할 뿐이고, 나중에 System Settings에서 허용할 수 있어요.
ru: Сам c11 не сканирует ваши файлы, и ничего не пересылается в Stage 11. Если вы откажете в доступе к папке, команда, вызвавшая запрос, просто завершится ошибкой, а разрешение вы сможете выдать позже в System Settings.
uk: Сам c11 не сканує ваші файли, і нічого не пересилається до Stage 11. Якщо ви відмовите в доступі до теки, команда, яка його спричинила, просто завершиться з помилкою, а ви зможете надати дозвіл пізніше в System Settings.
zh_hans: c11 本身不会扫描你的文件,也不会把任何内容转发给 Stage 11。如果你拒绝某个文件夹,触发该提示的命令只会失败,之后你可以在 System Settings 里再授予权限。
zh_hant: c11 本身不會掃描你的檔案,也不會把任何內容轉發給 Stage 11。如果你拒絕某個檔案夾,觸發該提示的指令只會失敗,之後你可以在 System Settings 裡再開啟權限。

# tccPrimer.body.whoAsks
source: The dialog will say "c11 wants to access…" because macOS attributes the request to the parent app. The actual requester is whatever you — or an agent — just ran.
ja: ダイアログには「c11 がアクセスを求めています…」と表示されます。macOS が要求を親アプリのものとして扱うからです。実際にリクエストしているのは、あなた — もしくはエージェント — がたった今実行したものです。
ko: 대화상자에는 "c11이 접근하려고 합니다…"라고 표시돼요. macOS가 요청을 부모 앱의 것으로 간주하기 때문이에요. 실제로 요청한 건 방금 당신 — 또는 에이전트 — 이 실행한 무언가예요.
ru: В диалоге будет написано «c11 запрашивает доступ…», потому что macOS приписывает запрос родительскому приложению. На самом деле запрос исходит от того, что вы — или агент — только что запустили.
uk: У діалозі буде написано «c11 хоче отримати доступ…», бо macOS приписує запит батьківському застосунку. Насправді його робить те, що ви — або агент — щойно запустили.
zh_hans: 对话框会写“c11 想要访问…”,因为 macOS 把请求归到父应用名下。真正发起请求的,其实是你 — 或者某个代理 — 刚刚运行的东西。
zh_hant: 對話框會寫「c11 想要存取…」,因為 macOS 把請求歸到父應用程式名下。真正發起請求的,其實是你 — 或某個代理 — 剛剛執行的東西。

# tccPrimer.body.why
source: c11 is a host for your shells and agents. The moment a process you started inside c11 touches a protected place — Downloads, Documents, Desktop, iCloud Drive, Music, Photos, Contacts, an external drive — macOS pauses and asks you whether that's OK. That's how TCC works: each folder is its own consent, and only you can grant it.
ja: c11 はあなたのシェルやエージェントの入れ物です。c11 の中で始めたプロセスが保護対象の場所 — Downloads、Documents、Desktop、iCloud Drive、Music、Photos、Contacts、外付けドライブ — に触れた瞬間、macOS はいったん止まって、それを許可してよいかあなたに尋ねます。これが TCC の仕組みです。フォルダごとに個別の同意が必要で、それを与えられるのはあなただけです。
ko: c11은 당신의 셸과 에이전트를 담는 호스트예요. c11 안에서 시작한 프로세스가 보호된 곳 — Downloads, Documents, Desktop, iCloud Drive, Music, Photos, Contacts, 외장 드라이브 — 에 닿는 순간, macOS는 잠깐 멈춰서 그래도 괜찮은지 당신에게 물어봐요. TCC는 이렇게 동작해요: 폴더마다 별도의 동의가 필요하고, 그 동의는 오직 당신만 줄 수 있어요.
ru: c11 — это хост для ваших оболочек и агентов. В тот момент, когда процесс, запущенный вами внутри c11, касается защищённого места — Downloads, Documents, Desktop, iCloud Drive, Music, Photos, Contacts, внешнего диска — macOS приостанавливается и спрашивает, согласны ли вы. Так устроен TCC: каждая папка — отдельное согласие, и дать его можете только вы.
uk: c11 — це хост для ваших оболонок та агентів. Щойно процес, який ви запустили всередині c11, торкається захищеного місця — Downloads, Documents, Desktop, iCloud Drive, Music, Photos, Contacts, зовнішнього диска — macOS призупиняється й запитує, чи це нормально. Саме так працює TCC: кожна тека — це окрема згода, і дати її можете лише ви.
zh_hans: c11 是你的 shell 和代理的宿主。当你在 c11 里启动的进程触及受保护的地方 — Downloads、Documents、Desktop、iCloud Drive、Music、Photos、Contacts、外接硬盘 — 时,macOS 会暂停,问你这是否可以。这就是 TCC 的工作方式:每个文件夹都要单独授权,而且只有你能授权。
zh_hant: c11 是你 shell 和代理的宿主。當你在 c11 裡啟動的程序觸及受保護的位置 — Downloads、Documents、Desktop、iCloud Drive、Music、Photos、Contacts、外接硬碟 — 時,macOS 會暫停,詢問你是否允許。TCC 就是這樣運作的:每個檔案夾都要單獨同意,而且只有你能給出同意。

# tccPrimer.button.continueWithout
source: Continue without it
ja: このまま続ける
ko: 없이 계속하기
ru: Продолжить без него
uk: Продовжити без нього
zh_hans: 不授予，继续
zh_hant: 不授予，繼續

# tccPrimer.button.gotIt
source: Got it
ja: わかりました
ko: 알겠어요
ru: Понятно
uk: Зрозуміло
zh_hans: 明白了
zh_hant: 明白了

# tccPrimer.button.grantFDA
source: Grant Full Disk Access
ja: Full Disk Access を許可
ko: Full Disk Access 허용
ru: Предоставить Full Disk Access
uk: Надати Full Disk Access
zh_hans: 授予 Full Disk Access
zh_hant: 授予 Full Disk Access

# tccPrimer.button.openSettings
source: Open Privacy & Security
ja: プライバシーとセキュリティを開く
ko: Privacy & Security 열기
ru: Открыть Privacy & Security
uk: Відкрити Privacy & Security
zh_hans: 打开 Privacy & Security
zh_hant: 打開 Privacy & Security

# tccPrimer.learnMore.body
source: Each prompt is tied to a specific macOS permission: folder prompts (Downloads, Documents, Desktop) fire when a child process reads or writes there; the iCloud Drive prompt fires when anything touches a File Provider domain; Music and Photos fire when a process reads the media libraries; Local Network fires on Bonjour or LAN HTTP. The copy inside each dialog comes from Info.plist and is c11-authored.
ja: それぞれのプロンプトは特定の macOS 権限に対応しています。フォルダ系(Downloads、Documents、Desktop)は子プロセスがそこを読み書きした瞬間に出ます。iCloud Drive のプロンプトは何かが File Provider ドメインに触れたときに。Music と Photos はプロセスがそのメディアライブラリを読んだときに。Local Network は Bonjour や LAN HTTP で発火します。各ダイアログ内の文面は Info.plist 由来で、c11 が書いたものです。
ko: 각 프롬프트는 특정 macOS 권한에 연결돼 있어요. 폴더 프롬프트(Downloads, Documents, Desktop)는 자식 프로세스가 거기서 읽거나 쓸 때 뜨고, iCloud Drive 프롬프트는 무언가가 File Provider 도메인에 닿을 때, Music과 Photos는 프로세스가 해당 미디어 보관함을 읽을 때, Local Network는 Bonjour나 LAN HTTP에서 뜨죠. 각 대화상자 안의 문구는 Info.plist에서 오고, c11이 직접 작성한 것이에요.
ru: Каждый запрос привязан к конкретному разрешению macOS: запросы папок (Downloads, Documents, Desktop) срабатывают, когда дочерний процесс читает или пишет в них; запрос iCloud Drive — когда что-то касается домена File Provider; Music и Photos — когда процесс читает эти медиатеки; Local Network — при Bonjour или LAN HTTP. Текст внутри каждого диалога берётся из Info.plist и написан c11.
uk: Кожен запит прив'язаний до конкретного дозволу macOS: запити на теки (Downloads, Documents, Desktop) спрацьовують, коли дочірній процес читає або пише в них; запит iCloud Drive — коли щось торкається домену File Provider; Music і Photos — коли процес читає медіатеки; Local Network — на Bonjour або LAN HTTP. Текст усередині кожного діалогу береться з Info.plist і написаний c11.
zh_hans: 每个提示都绑定到一个具体的 macOS 权限:文件夹提示(Downloads、Documents、Desktop)在子进程读写时出现;iCloud Drive 提示在任何东西触及 File Provider 域时出现;Music 和 Photos 在进程读取对应媒体库时出现;Local Network 在 Bonjour 或 LAN HTTP 时出现。每个对话框里的文字都来自 Info.plist,是由 c11 撰写的。
zh_hant: 每個提示都對應一個特定的 macOS 權限:檔案夾提示(Downloads、Documents、Desktop)在子程序讀寫時出現;iCloud Drive 提示在任何東西觸及 File Provider 網域時出現;Music 和 Photos 在程序讀取相應媒體資料庫時出現;Local Network 在 Bonjour 或 LAN HTTP 時出現。每個對話框裡的文字都來自 Info.plist,是由 c11 撰寫的。

# tccPrimer.learnMore.title
source: What triggers each prompt
ja: 各プロンプトが出る条件
ko: 각 프롬프트가 뜨는 조건
ru: Что вызывает каждый запрос
uk: Що спричиняє кожен запит
zh_hans: 每个提示的触发条件
zh_hant: 各提示的觸發條件

# tccPrimer.title
source: Before your first shell opens.
ja: 最初のシェルが開く前に。
ko: 첫 번째 셸이 열리기 전에.
ru: Прежде чем откроется ваш первый шелл.
uk: Перш ніж відкриється ваш перший шел.
zh_hans: 在您的第一个 shell 打开之前。
zh_hant: 在您的第一個 shell 打開之前。

# tccPrimer.windowTitle
source: c11 and macOS permissions
ja: c11 と macOS の権限
ko: c11과 macOS 권한
ru: c11 и разрешения macOS
uk: c11 та дозволи macOS
zh_hans: c11 与 macOS 权限
zh_hant: c11 與 macOS 權限

# textbox.escapeBehavior.focusTerminal
source: Focus Terminal
ja: ターミナルにフォーカス
ko: 터미널에 포커스
ru: Фокус в терминал
uk: Фокусувати термінал
zh_hans: 聚焦终端
zh_hant: 聚焦終端機

# textbox.escapeBehavior.sendEscape
source: Send ESC Key
ja: ESC キーを送信
ko: ESC 키 보내기
ru: Отправить клавишу ESC
uk: Надіслати клавішу ESC
zh_hans: 发送 ESC 键
zh_hant: 傳送 ESC 鍵

# textbox.placeholder.enterToNewline
source: Commands or prompts here… Shift+Return to send
ja: コマンドやプロンプトを入力… Shift+Return で送信
ko: 명령어 또는 프롬프트… Shift+Return으로 보내기
ru: Команды или запросы сюда… Shift+Return — отправить
uk: Команди чи запити сюди… Shift+Return — надіслати
zh_hans: 命令或提示写在这里…… Shift+Return 发送
zh_hant: 指令或提示詞填這裡… Shift+Return 傳送

# textbox.placeholder.enterToSend
source: Commands or prompts here… Shift+Return for newline
ja: コマンドやプロンプトを入力… Shift+Return で改行
ko: 명령어 또는 프롬프트… Shift+Return으로 줄바꿈
ru: Команды или запросы сюда… Shift+Return — новая строка
uk: Команди чи запити сюди… Shift+Return — новий рядок
zh_hans: 命令或提示写在这里…… Shift+Return 换行
zh_hant: 指令或提示詞填這裡… Shift+Return 換行

# textbox.send.tooltip
source: Send
ja: 送信
ko: 보내기
ru: Отправить
uk: Надіслати
zh_hans: 发送
zh_hant: 傳送

# textbox.shortcutBehavior.toggleDisplay
source: Toggle Display
ja: 表示を切り替え
ko: 표시 전환
ru: Переключить показ
uk: Перемкнути показ
zh_hans: 切换显示
zh_hant: 切換顯示

# textbox.shortcutBehavior.toggleFocus
source: Toggle Focus
ja: フォーカスを切り替え
ko: 포커스 전환
ru: Переключить фокус
uk: Перемкнути фокус
zh_hans: 切换焦点
zh_hant: 切換聚焦

# theme.dark
source: Dark
ja: ダーク
ko: 다크
ru: Темная
uk: Темна
zh_hans: 深色
zh_hant: 深色

# theme.light
source: Light
ja: ライト
ko: 라이트
ru: Светлая
uk: Світла
zh_hans: 浅色
zh_hant: 淺色

# theme.system
source: System
ja: システム
ko: 시스템
ru: Системная
uk: Системна
zh_hans: 系统
zh_hant: 系統

# titlebar.chevron.collapse
source: Collapse title bar
ja: タイトルバーを折りたたむ
ko: 제목 표시줄 접기
ru: Свернуть строку заголовка
uk: Згорнути смугу заголовка
zh_hans: 折叠标题栏
zh_hant: 收合標題列

# titlebar.chevron.expand
source: Expand title bar
ja: タイトルバーを展開
ko: 제목 표시줄 펼치기
ru: Развернуть строку заголовка
uk: Розгорнути смугу заголовка
zh_hans: 展开标题栏
zh_hant: 展開標題列

# titlebar.empty_title
source: Untitled
ja: タイトルなし
ko: 제목 없음
ru: Без названия
uk: Без назви
zh_hans: 无标题
zh_hant: 未命名

# titlebar.newWorkspace.accessibilityLabel
source: New Workspace
ja: 新規ワークスペース
ko: 새 작업 공간
ru: Новое рабочее пространство
uk: Новий робочий простір
zh_hans: 新建工作区
zh_hant: 新增工作區

# titlebar.newWorkspace.tooltip
source: New workspace
ja: 新規ワークスペース
ko: 새 작업 공간
ru: Новое рабочее пространство
uk: Новий робочий простір
zh_hans: 新建工作区
zh_hant: 新增工作區

# titlebar.notifications.accessibilityLabel
source: Notifications
ja: 通知
ko: 알림
ru: Уведомления
uk: Сповіщення
zh_hans: 通知
zh_hant: 通知
